<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"0b2ff547ba79b9b03a58c6cc93a3e395a0e82682ce88f6268b5ee1b3086482ab","plan_job_ref":"Job Terraform plan (OIDC) #3 at https://github.com/hackforla/incubator/actions/runs/11944641692","plan_out_hash":"c55f42bd1ea7bf79c5bd3cb619d51211d83d817feb4ac7b4bb338fd9181ff2a2","plan_hash":"44744f9bd197c540ac6636a84dd049457014d1ad9d27b65aa7b9eaccf41d93c5","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__
With backend config files: `terraform/prod.backend.tfvars`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_iam_role.instance will be created
+   resource "aws_iam_role" "instance" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "incubator_test_role"
+       name_prefix           = (known after apply)
+       path                  = "/system/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan (OIDC) #3](https://github.com/hackforla/incubator/actions/runs/11944641692)